First `alert_notification_destinations` is created and `id` is the output when it is created. So I have not defined the `id`. 
This `id` would be the input to `alert_notification_channels`. If I define it it would to enter the value of it.

```
module "alert_notification_destination_email" {
  source     = "../alert_notification_destination_email_v3"
  count      = var.notification_destination_email_create ? 1 : 0
  name       = var.notification_destination_email_name
  recipients = var.notification_destination_email_recipients
}
```
```
# module.alert_notification_destination_email[0].newrelic_notification_destination.email_destination will be created
  + resource "newrelic_notification_destination" "email_destination" {
      + account_id = (known after apply)
      + active     = true
      + id         = (known after apply) ## This is value which needs to be input for below TF module and its resource
      + last_sent  = (known after apply)
      + name       = "test-email-name"
      + status     = (known after apply)
      + type       = "EMAIL"

      + property {
          + key   = "email"
          + value = "test@eagleinvsys.com"
        }
    }
```

![terragrunt](https://user-images.githubusercontent.com/49336831/196154427-d190dbf7-f10f-469b-a76c-a15a9f3a305c.png)
